{
  "posts": [
    {
      "title": "Интернет програмиране с Java",
      "authors": [
        "Светлин Наков"
      ],
      "thumbnail": "http://books.google.com/books/content?id=yN89nA466C0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2004-11-22",
      "categories": [
        "Computers"
      ],
      "description": "Интернет програмиране с Java Светлин е опитен програмист, многократно доказан специалист по съвременни софтуерни технологии, талантлив лектор. Неговите курсове в Софийски Университет са сред най-високо ценените, най-полезните и най-посещаваните. Със своите лекции и презентации по научни и технически конференции и семинари той неведнъж е събирал аплодис­ментите на начинаещи и професионални софтуерни разработчици. В духа на своята творческа натура и нестихващ академичен идеализъм през 2002 Светлин, заедно със свои колеги, разработи курса „Интернет програмиране с Java”. По време на обучението на студентите от Факултета по математика и информатика на Софийски университет, които избраха да слушат този курс, Светлин и колегите му създадоха лекции по “Интернет програмиране с Java”, които по-късно станаха основа на серия от статии в списание “PC Magazine/Bulgaria”. В последствие, с много труд и усилия тези учебни материали достигнаха един завършен академичен вид и станаха основа на настоящия учебник. Книгата „Интернет програмиране с Java” е едно отлично въведение в най-важните аспекти на програмирането с Java за Интернет. В нея се обръща внимание на проблемите на многонишковото програмиране и синхронизацията, разработката на Java приложения, които комуникират по протоколите TCP/IP, създаването на Java аплети, комуникацията между аплет и сървър, разработката на Web-приложения с технологиите Java Servlets и Java Server Pages (JSP) и изпълнението им на сървъра за Web-приложения Tomcat. Настоящата книга е официален учебник за дисциплината „Интернет програмиране с Java”, преподавана от Светлин Наков и ръководения от него екип във факултетa по математика и информатика (ФМИ) на Софийски Университет „Св. Климент Охридски” през 2004 г. Съдържание Отзив за книгата „Интернет програмиране с Java”........................................................6 Съдържание.......................................................................................................................8 Предговор..........................................................................................................................9 Глава 1. Разработка на Java приложения, които си комуникират по TCP/IP мрежи..14 1.1. Как работи Интернет. Основи на TCP/IP мрежите.......................................15 1.2. Вход/изход в Java...............................................................................................25 1.3. Многонишково програмиране и синхронизация на нишки в Java...............29 1.3.1. Многонишково програмиране в Java...............................................................29 1.3.2. Синхронизация на нишки.................................................................................31 1.4. TCP сокети..........................................................................................................40 1.4.1. TCP forward сървър............................................................................................52 1.4.2. Многопотребителски сървър за разговори (chat server)..................................60 1.5. UDP сокети..........................................................................................................77 1.6. Multicast сокети....................................................................................................81 1.7. Работа с URL ресурси.........................................................................................87 Глава 2. Java аплети...........................................................................................................91 2.1. Въведение в Java аплетите................................................................................92 2.2. Особености на аплетите и работата с AWT....................................................106 2.3. Java аплети и сигурност. Комуникация със сървъра......................................115 Глава 3. Разработка на Web-приложения с Java.............................................................123 3.1. Основни понятия. Web-сървър. Протокол HTTP...........................................124 3.2. Основни концепции в Web-програмирането.................................................134 3.3. Java базирани Web-приложения.......................................................................142 3.4. Java сървлети.......................................................................................................145 3.5. Работа със сървъра Tomcat.................................................................................148 3.6. HTML форми и извличане на данните от тях..................................................156 3.7. Жизнен цикъл на сървлетите............................................................................161 3.8. Поддръжка на потребителски сесии.................................................................168 3.9. Java Server Pages (JSP).........................................................................................177 3.10. Сървлет филтри..................................................................................................193 3.11. Тънкости при разработката на Web-приложения с Java.................................200 3.12. Цялостен пример за Web-приложение.............................................................207 Поглед към следващото издание на книгата.....................................................................238 Заключение..........................................................................................................................239",
      "id": 2
    },
    {
      "title": "Beginning JavaScript",
      "authors": [
        "Jeremy McPeak"
      ],
      "thumbnail": "http://books.google.com/books/content?id=bzekBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "John Wiley & Sons",
      "publishedDate": "2015-02-17",
      "categories": [
        "Computers"
      ],
      "description": "The bestselling JavaScript guide, updated with current features and best practices Beginning JavaScript 5th Edition shows you how to work effectively with JavaScript frameworks, functions, and modern browsers, and teaches more effective coding practices using HTML5. This new edition has been extensively updated to reflect the way JavaScript is most commonly used today, introducing you to the latest tools and techniques available to JavaScript developers. Coverage includes modern coding practices using HTML5 markup, the JSON data format, DOM APIs, the jQuery framework, and more. Exercises with solutions provide plenty of opportunity to practice, and the companion website offers downloadable code for all examples given in the book. Learn JavaScript using the most up to date coding style Understand JSON, functions, events, and feature detection Utilize the new HTML5 elements and the related API Explore new features including geolocation, local storage, and more JavaScript has shaped the Web from a passive medium into one that is rich, dynamic, and interactive. No matter the technology on the server side, it's JavaScript that makes it come alive in the browser. To learn JavaScript the way it's used today, Beginning JavaScript, 5th Edition is your concise guide.",
      "id": 4
    },
    {
      "title": "JavaScript",
      "authors": [
        "David Flanagan"
      ],
      "thumbnail": "http://books.google.com/books/content?id=4RChxt67lvwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2011-04-25",
      "categories": [
        "Computers"
      ],
      "description": "A revised and updated edition offers comprehensive coverage of ECMAScript 5 (the new JavaScript language standard) and also the new APIs introduced in HTML5, with chapters on functions and classes completely rewritten and updated to match current best practices and a new chapter on language extensions and subsets. Original.",
      "id": 5
    },
    {
      "title": "Cvětosăbranie c'rkovno-slavjanskago ili staro-bălgarskago jazyka",
      "authors": [
        "Nikifor Konstantinov"
      ],
      "thumbnail": "http://books.google.com/books/content?id=VlxcAAAAcAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publishedDate": "1858",
      "id": 6
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 7
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 8
    },
    {
      "title": "Java за цифрово подписване на документи в уеб",
      "authors": [
        "Светлин Наков"
      ],
      "thumbnail": "http://books.google.com/books/content?id=tVlr4BRf39AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2005-05-24",
      "categories": [
        "Computers"
      ],
      "description": "Java за цифрово подписване на документи в уеб Настоящата разработка има за цел да запознае читателя с проблемите, свързани с цифровото подписване на документи в уеб среда и да предложи конкретни подходи за тяхното решаване. След кратък анализ на съществу­ващите решения се прави преглед на технологиите, проектира се и се имплементира Java-базирана система за цифрово подписване на документи в уеб и верификация на цифрови подписи и сертификати. Проблемът с цифровите подписи в уеб среда Днешните уеб браузъри нямат стандартна функционалност за подписване на прикачени файлове при изпращането им от клиента към уеб сървъра. Това води до проблеми при реализацията на някои специфични прило­жения, в които потребителят трябва да удостовери по надежден начин, че той е изпратил даден документ. Примери за такива приложения са взаимодействи­ето с електрон­ното правителство, електронно банкиране, някои финансови системи и др. Цели Целта, която си поставяме, е да се разработи технология за цифрово подпис­ване на документи в уеб среда, основана на инфраструк­турата на публичния ключ (PKI) и сървърен софтуер, който посреща подпи­саните документи и проверява валидността на сигнатурата им и използвания цифров серти­фикат. Разработената технология трябва да е независима от операционната система и от уеб браузъра на потребителя. Потенциални потребители С въвеждането на електрон­ното правителство и увеличаването на услу­гите, извършвани по електронен път, нуждата от средства за цифрово подписване на документи нараства. Нараства и необходимостта този процес да се извършва в уеб среда за да максимално лесно достъпен за обикновения гражданин. Като потенциални потребители на разработената технология можем да идентифицираме уеб разработчиците, които в своите приложения трябва да прилагат технологията на цифровия подпис. Предложеното решение е базирано на Java технологиите, но може да бъде използвано и от други уеб разработчици, тъй като използва отворени стандарти, необвързани с Java платформата. Цифрови подписи и сертификати В първа глава е направен обзор на терминологията, проблемите и техноло­гиите, свързани с използването на цифров подпис в уеб среда. Изясняват са понятията, свързани с цифровия подпис, моделите на дове­рие между непознати страни и инфраструктурата на публичния ключ: публичен ключ, личен ключ, цифров сертификат, сертификационен орган, сертифика­ционна верига, защитено хранилище за ключове и сертификати и др. Описват се процедурите и алгоритмите за цифрово подписване на документи и верификация на цифрови подписи. Изяснява се технологията на смарт картите като сигурен и надежден начин за съхранение на ключове и сертификати. Прави се преглед на съществуващите технологии за подписване на документи в уеб среда. Анализират се техните силни и слаби страни. Разглеждат се начините за реализация на система за подписване на доку­менти в клиентския уеб браузър, работеща върху всички операционни системи и всички масово разпространени уеб браузъри. Обосновава се необходимостта от използване на подписан Java аплет, който подписва файловете преди изпращането им от клиента към сървъра. Работа с цифрови подписи и сертификати в Java Във втора глава се разглеждат библиотеките от класове за работа с цифрови подписи и сертификати, които Java 2 платформата предоставя. Дава се описание на класовете и интерфейсите от Java Cryptography Architecture (JCA) и Java Certification Path API, които имат отношение към работата с цифрови подписи и сертификати. Разглеждат се и средствата за достъп до смарт карти от Java. Дават се конкретни насоки как разгледаните класове могат да се използват за полагане на цифров подпис, верификация на цифров подпис и верифи­ка­ция на цифрови сертификати и сертификационни вериги. Проектиране на система за цифрово подписване в уеб среда В трета глава се анализират и решават конкретните проблеми, свързани с реализаци­ята на Java-базирана система за цифрово подписване на доку­менти в уеб среда. Проектират се отделните компоненти на системата –Java аплет, който подписва документите в клиентския уеб браузър (във вариант за работа с локален сертификат и със смарт карта), уеб приложе­ние, което посреща подписаните документи с подсис­тема за верификация на цифровия подпис и подсистема за верификация на сертификата на потребителя. Обосновава се необходимостта Java аплетът, който подписва документи, да работи с повишени права. Разглежда се технологията за подписване на Java аплети с цел повишаване на правата, с които се изпълняват. Разглеж­дат се и средствата за комуникация между аплет и уеб браузър. От страна на сървъра се разглежда проблемът с верификацията на цифро­вия подпис и начините за верификация на цифрови сертификати. Разглеж­дат се двата подхода за верификацията на сертификата на потребителя, които имат приложение при различни сценарии за използване на цифров подпис. Единият подход е директна верификация, при която се проверява дали сертификатът на клиента е директно издаден от даден сертификат, на който сървърът има доверие. Другият подход е класическият – проверка за валидност на цялата сертификационната верига, която започва от клиент­ския сертификат и трябва да завършва със сертификат, на който сървъра има доверие. Реализация на системата за цифрово подписване в уеб среда В четвърта глава се преминава през стъпките за конкретната реализация на вече проектираната система за подписване на документи в уеб среда. Реализацията е наречена NakovDocumentSigner и предоставя напълно функционално рамково приложение (framework) за цифрово подписване на документи в Java-базирани уеб приложения. Системата демонстрира как със средствата на Java 2 платформата могат да се подписват документи в уеб среда и да се верифицират цифрови подписи, сертификати и сертификационни вериги. Включен е пълният сорс код на отделните компоненти на системата, придружен с разяснения за тяхната работа. Приложени са и скриптове и инструкции за компили­ране, настройка и внедряване на системата. Тестване, оценка и усъвършенстване В пета глава е направена критична оценка на реализираната система за подписване на документи в уеб среда. Системата е тествана под различни операционни системи и уеб браузъри и оценена е нейната работоспособ­ност. Анализирани са недостатъците на системата и са описани посоките за нейното бъдещо развитие и възможностите за подобрение.",
      "id": 9
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 10
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 11
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 12
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 13
    },
    {
      "title": "JavaScript",
      "authors": [
        "David Flanagan"
      ],
      "thumbnail": "http://books.google.com/books/content?id=4RChxt67lvwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2011-04-25",
      "categories": [
        "Computers"
      ],
      "description": "A revised and updated edition offers comprehensive coverage of ECMAScript 5 (the new JavaScript language standard) and also the new APIs introduced in HTML5, with chapters on functions and classes completely rewritten and updated to match current best practices and a new chapter on language extensions and subsets. Original.",
      "id": 14
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 15
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 16
    },
    {
      "title": "Въведение в програмирането с Java",
      "authors": [
        "Светлин Наков и колектив"
      ],
      "thumbnail": "http://books.google.com/books/content?id=c4sIJMJhd84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2009-10-20",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Въведение в програмирането с Java\" предоставя на начинаещите програмисти стабилна основа от фундаментални знания без значение от езика за програмиране. Тя обхваща фундаменталните основи на програмирането, които не са се променили съществено през последните 10-15 години. Учебното съдържание е разработено от авторитетен авторски колектив под ръководството на Светлин Наков от Софтуерния университет (СофтУни) и покрива както начални теми като променливи, условни конструкции, цикли и масиви, така и по-сложни концепции като структури от данни (списъци, стекове, опашки, дървета, хеш-таблици и други), рекурсия и рекурсивни алгоритми, обектно-ориентирано програмиране и качествен програмен код. От книгата ще научите как да мислите и разсъждавате като програмисти и как ефективно и качествено да решавате задачи по програмиране. Ще овладеете фундаменталните принципи на програмирането и основните структури от данни и алгоритми, без които не можете да станете софтуерен инженер. Книгата е на български език с обем 962 страници и се разпространява безплатно в електронен формат, както и в печатен вариант на хартия. Официален уеб сайт: http://www.introprogramming.info/intro-java-book/",
      "id": 17
    },
    {
      "title": "Java за цифрово подписване на документи в уеб",
      "authors": [
        "Светлин Наков"
      ],
      "thumbnail": "http://books.google.com/books/content?id=tVlr4BRf39AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2005-05-24",
      "categories": [
        "Computers"
      ],
      "description": "Java за цифрово подписване на документи в уеб Настоящата разработка има за цел да запознае читателя с проблемите, свързани с цифровото подписване на документи в уеб среда и да предложи конкретни подходи за тяхното решаване. След кратък анализ на съществу­ващите решения се прави преглед на технологиите, проектира се и се имплементира Java-базирана система за цифрово подписване на документи в уеб и верификация на цифрови подписи и сертификати. Проблемът с цифровите подписи в уеб среда Днешните уеб браузъри нямат стандартна функционалност за подписване на прикачени файлове при изпращането им от клиента към уеб сървъра. Това води до проблеми при реализацията на някои специфични прило­жения, в които потребителят трябва да удостовери по надежден начин, че той е изпратил даден документ. Примери за такива приложения са взаимодействи­ето с електрон­ното правителство, електронно банкиране, някои финансови системи и др. Цели Целта, която си поставяме, е да се разработи технология за цифрово подпис­ване на документи в уеб среда, основана на инфраструк­турата на публичния ключ (PKI) и сървърен софтуер, който посреща подпи­саните документи и проверява валидността на сигнатурата им и използвания цифров серти­фикат. Разработената технология трябва да е независима от операционната система и от уеб браузъра на потребителя. Потенциални потребители С въвеждането на електрон­ното правителство и увеличаването на услу­гите, извършвани по електронен път, нуждата от средства за цифрово подписване на документи нараства. Нараства и необходимостта този процес да се извършва в уеб среда за да максимално лесно достъпен за обикновения гражданин. Като потенциални потребители на разработената технология можем да идентифицираме уеб разработчиците, които в своите приложения трябва да прилагат технологията на цифровия подпис. Предложеното решение е базирано на Java технологиите, но може да бъде използвано и от други уеб разработчици, тъй като използва отворени стандарти, необвързани с Java платформата. Цифрови подписи и сертификати В първа глава е направен обзор на терминологията, проблемите и техноло­гиите, свързани с използването на цифров подпис в уеб среда. Изясняват са понятията, свързани с цифровия подпис, моделите на дове­рие между непознати страни и инфраструктурата на публичния ключ: публичен ключ, личен ключ, цифров сертификат, сертификационен орган, сертифика­ционна верига, защитено хранилище за ключове и сертификати и др. Описват се процедурите и алгоритмите за цифрово подписване на документи и верификация на цифрови подписи. Изяснява се технологията на смарт картите като сигурен и надежден начин за съхранение на ключове и сертификати. Прави се преглед на съществуващите технологии за подписване на документи в уеб среда. Анализират се техните силни и слаби страни. Разглеждат се начините за реализация на система за подписване на доку­менти в клиентския уеб браузър, работеща върху всички операционни системи и всички масово разпространени уеб браузъри. Обосновава се необходимостта от използване на подписан Java аплет, който подписва файловете преди изпращането им от клиента към сървъра. Работа с цифрови подписи и сертификати в Java Във втора глава се разглеждат библиотеките от класове за работа с цифрови подписи и сертификати, които Java 2 платформата предоставя. Дава се описание на класовете и интерфейсите от Java Cryptography Architecture (JCA) и Java Certification Path API, които имат отношение към работата с цифрови подписи и сертификати. Разглеждат се и средствата за достъп до смарт карти от Java. Дават се конкретни насоки как разгледаните класове могат да се използват за полагане на цифров подпис, верификация на цифров подпис и верифи­ка­ция на цифрови сертификати и сертификационни вериги. Проектиране на система за цифрово подписване в уеб среда В трета глава се анализират и решават конкретните проблеми, свързани с реализаци­ята на Java-базирана система за цифрово подписване на доку­менти в уеб среда. Проектират се отделните компоненти на системата –Java аплет, който подписва документите в клиентския уеб браузър (във вариант за работа с локален сертификат и със смарт карта), уеб приложе­ние, което посреща подписаните документи с подсис­тема за верификация на цифровия подпис и подсистема за верификация на сертификата на потребителя. Обосновава се необходимостта Java аплетът, който подписва документи, да работи с повишени права. Разглежда се технологията за подписване на Java аплети с цел повишаване на правата, с които се изпълняват. Разглеж­дат се и средствата за комуникация между аплет и уеб браузър. От страна на сървъра се разглежда проблемът с верификацията на цифро­вия подпис и начините за верификация на цифрови сертификати. Разглеж­дат се двата подхода за верификацията на сертификата на потребителя, които имат приложение при различни сценарии за използване на цифров подпис. Единият подход е директна верификация, при която се проверява дали сертификатът на клиента е директно издаден от даден сертификат, на който сървърът има доверие. Другият подход е класическият – проверка за валидност на цялата сертификационната верига, която започва от клиент­ския сертификат и трябва да завършва със сертификат, на който сървъра има доверие. Реализация на системата за цифрово подписване в уеб среда В четвърта глава се преминава през стъпките за конкретната реализация на вече проектираната система за подписване на документи в уеб среда. Реализацията е наречена NakovDocumentSigner и предоставя напълно функционално рамково приложение (framework) за цифрово подписване на документи в Java-базирани уеб приложения. Системата демонстрира как със средствата на Java 2 платформата могат да се подписват документи в уеб среда и да се верифицират цифрови подписи, сертификати и сертификационни вериги. Включен е пълният сорс код на отделните компоненти на системата, придружен с разяснения за тяхната работа. Приложени са и скриптове и инструкции за компили­ране, настройка и внедряване на системата. Тестване, оценка и усъвършенстване В пета глава е направена критична оценка на реализираната система за подписване на документи в уеб среда. Системата е тествана под различни операционни системи и уеб браузъри и оценена е нейната работоспособ­ност. Анализирани са недостатъците на системата и са описани посоките за нейното бъдещо развитие и възможностите за подобрение.",
      "id": 18
    },
    {
      "title": "JavaScript",
      "authors": [
        "David Flanagan"
      ],
      "thumbnail": "http://books.google.com/books/content?id=4RChxt67lvwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "\"O'Reilly Media, Inc.\"",
      "publishedDate": "2011-04-25",
      "categories": [
        "Computers"
      ],
      "description": "A revised and updated edition offers comprehensive coverage of ECMAScript 5 (the new JavaScript language standard) and also the new APIs introduced in HTML5, with chapters on functions and classes completely rewritten and updated to match current best practices and a new chapter on language extensions and subsets. Original.",
      "id": 19
    },
    {
      "title": "TCP/IP Sockets in Java",
      "authors": [
        "Kenneth L. Calvert",
        "Michael J. Donahoo"
      ],
      "thumbnail": "http://books.google.com/books/content?id=lfHo7uMk7r4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Morgan Kaufmann",
      "publishedDate": "2011-08-29",
      "categories": [
        "Computers"
      ],
      "description": "The networking capabilities of the Java platform have been extended considerably since the first edition of the book. This new edition covers version 1.5-1.7, the most current iterations, as well as making the following improvements: The API (application programming interface) reference sections in each chapter, which describe the relevant parts of each class, have been replaced with (i) a summary section that lists the classes and methods used in the code, and (ii) a \"gotchas\" section that mentions nonobvious or poorly-documented aspects of the objects. In addition, the book covers several new classes and capabilities introduced in the last few revisions of the Java platform. New abstractions to be covered include NetworkInterface, InterfaceAddress, Inet4/6Address, SocketAddress/InetSocketAddress, Executor, and others; extended access to low-level network information; support for IPv6; more complete access to socket options; and scalable I/O. The example code is also modified to take advantage of new language features such as annotations, enumerations, as well as generics and implicit iterators where appropriate. Most Internet applications use sockets to implement network communication protocols. This book's focused, tutorial-based approach helps the reader master the tasks and techniques essential to virtually all client-server projects using sockets in Java. Chapter 1 provides a general overview of networking concepts to allow readers to synchronize the concepts with terminology. Chapter 2 introduces the mechanics of simple clients and servers. Chapter 3 covers basic message construction and parsing. Chapter 4 then deals with techniques used to build more robust clients and servers. Chapter 5 (NEW) introduces the scalable interface facilities which were introduced in Java 1.5, including the buffer and channel abstractions. Chapter 6 discusses the relationship between the programming constructs and the underlying protocol implementations in more detail. Programming concepts are introduced through simple program examples accompanied by line-by-line code commentary that describes the purpose of every part of the program. No other resource presents so concisely or so effectively the material necessary to get up and running with Java sockets programming. Focused, tutorial-based instruction in key sockets programming techniques allows reader to quickly come up to speed on Java applications. Concise and up-to-date coverage of the most recent platform (1.7) for Java applications in networking technology.",
      "id": 20
    },
    {
      "title": "Основи на програмирането с JavaScript",
      "authors": [
        "Светлин Наков",
        "Екипът на Наков"
      ],
      "thumbnail": "http://books.google.com/books/content?id=fzeyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Faber Publishing",
      "publishedDate": "2018-05-30",
      "categories": [
        "Computers"
      ],
      "description": "Безплатната книга \"Основи на програмирането с JavaScript\" е официален учебник за курса \"Programming Basics\" в Софтуерния университет (СофтУни), който дава старт в писането на код на десетки хиляди млади хора: https://softuni.bg/courses/programming-basics. Книгата запознава читателите с писането на програмен код на начално ниво (basic coding skills), работа със среда за разработка (IDE), използване на променливи и данни, оператори и изрази, работа с конзолата (четене на входни данни и печатане на резултати), използване на условни конструкции (if, if-else, switch-case), цикли (for, while, do-while) и работа с функции (деклариране и извикване на функции, подаване на параметри и връщане на стойност). Използват се езикът за програмиране JavaScript и средата за разработка Visual Studio Code. Обхванатият учебен материал дава базова подготовка за по-задълбочено изучаване на програмирането и подготвя читателите за приемния изпит в СофтУни. Книгата разчита на подходите \"обяснения чрез примери\" и \"учене чрез правене\", за да изгражда практически умения по програмиране, необходими за старт в професията \"софтуерен инженер\". Учебното съдържание се предава на малки порции с надграждане във всяка следваща глава и със солидно количество практически упражнения с автоматизирана система за проверка на сорс кода на решенията в реално време (online judge system). Упражненията се предоставят в поредица с нарастваща сложност: от съвсем тривиални, през малко по-трудни до задачи с висока трудност, които изискват повече мисъл и търсене на информация в Интернет. Повечето задачи идват с детайлно разписани стъпки за решаването им, комбинирани с примерен код или фрагменти от код. Книгата е написана от екип от доброволци, софтуерни инженери-практици, под ръководството на д-р Светлин Наков (https://nakov.com), които отделиха от своето време, за да ви подарят систематизирано знание с много примери и задачи, организирано във формата на постъпково ръководство за стартиращи в програмирането. Разпространява се безплатно в Интернет, под отворен лиценз. Изтеглете безплатната JavaScript книга от нейния уеб сайт: https://js-book.softuni.bg. Тагове: книга, програмиране, безплатна, безплатн книга, книга за програмиране, компютърно програмиране, кодиране, писане на код, основи на програмирането, programming basics, ebook, JavaScript, джаваскрипт, JS, JavaScript книга, JS книга, Visual Studio Code, самоучител, JavaScript самоучител, програмиране основи, типове данни, променливи, оператори, изрази, изчисления, statements, конзолен вход и изход, програмна логика, условни конструкции, вложени условия, цикли, вложени цикли, функции, параметри на функциите, връщана стойност от функция, решаване на задачи, problem solving, практически упражнения, практическо програмиране, учене чрез примери, учене чрез правене, примерен сорс код, автоматизирана проверка на решенията, online judge system, Наков, Nakov, Светлин Наков, Svetlin Nakov, СофтУни, SoftUni, ISBN 978-619-00-0702-9, ISBN 9786190007029 Съдържание Предговор - историята на тази книга и какво ще научим от нея 1. Първи стъпки в програмирането - IDE, команди, програми 2.1. Прости пресмятания - променливи, данни, изчисления, вход / изход 2.2. Прости пресмятания – изпитни задачи 3.1. Прости проверки - if-else конструкция 3.2. Прости проверки – изпитни задачи 4.1. По-сложни проверки - вложени if-else, по-сложни условия 4.2. По-сложни проверки – изпитни задачи 5.1. Повторения (цикли) - for-цикъл, повратяне n пъти 5.2. Цикли – изпитни задачи 6.1. Вложени цикли - nested loops, извеждане на таблични данни 6.2. Вложени цикли – изпитни задачи 7.1. По-сложни цикли - цикли със стъпка, while-цикъл, do-while, break 7.2. По-сложни цикли – изпитни задачи 8.1. Подготовка за практически изпит – част I - изпитни задачи 8.2. Подготовка за практически изпит – част II - изпитни задачи 9.1. Задачи за шампиони – част I - по-сложни задачи 9.2. Задачи за шампиони – част II - по-сложни задачи 10. Функции - дефиниране и извикване на функция, параметри, връщане на стойност 11. Хитрости и хакове - бързи клавиши, шаблони с код, дебъгване Заключение - до къде стигнахме и накъде да продължим",
      "id": 21
    },
    {
      "title": "If anything can go wrong, pass it on to someone else! (Florentin's Laws)",
      "authors": [
        "V. Christianto"
      ],
      "thumbnail": "http://books.google.com/books/content?id=tgzeBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "publisher": "Infinite Study",
      "publishedDate": "1990",
      "categories": [
        "Literary Collections"
      ],
      "description": "Being paradoxist in nature, Florentin's Laws are especially deviations, modifications, generalizations, contra-sayings, parodies, or mixtures of the previous Murphy's Laws and Peter's Laws. And also of aphorisms, proverbs, known citations, cliches, scientific results (from physics, mathematics, philosophy, ...), etc.Alternatively, collations of opposite ideas - gathered from folklore, from ads, from literature, from familiar speech.For example, Murphy's law ?Anything that can go wrong will go wrong'which in Peter's law is stated as:?If anything can go wrong, Fix It!?becomes in Florentin's law, through deviation:?If anything can go wrong, pass it on to someone else!?in a Machiavelli way, as a mixture of pessimism / optimism and laugh!In the above example, while Murphy's law output is negative and Peter's law output is positive, Florentin's law output is indeterminate [perversity] as in neutrosophic logic (i. e. the problem has not be solved, but passed to another person!... it's a trickery (deception, cunning, dodge, swindle, caper, subterfuge).Each Florentin's Law should include: negative (pessimism) and positive (optimism) attributes, while its conclusion should be moderate ? often trickery bended with humor.",
      "id": 22
    }
  ]
}